[
    {
        "title": "Physics",
        "author": "Quick Revision",
        
        "description": "Chapter 1 To Chapter 5",
        "story": "Chapter 1 gives students a basic understanding of the past and the development of laws in physics.  Physics is a fundamental science concerned with understanding the natural phenomena that occur in our universe. It has many branches such as Mechanics, Electromagnetism, Thermodynamics, Modem Physics, etc. Between 1600 and 1900, three broad areas were developed, which is together called Classical Physics. These three areas of study are classical mechanics, thermodynamics and electromagnetism. But by 1905 it became apparent that classical ideas failed to explain several phenomena. Then some new theories were developed in what is called Modem Physics such as Special Relativity, Quantum Mechanics, etc.                                                                          Chapter2:-                                                                      1st :-  Measurement:- The process of measurement is basically a comparison process. To measure a physical quantity, we have to find out how many times a standard amount of that physical quantity is present in the quantity being measured. The number thus obtained is known as the magnitude and the standard chosen is called the unit of the physical quantity.                                                                           2nd :- Unit:- The unit of a physical quantity is an arbitrarily chosen standard which is widely accepted by the society and in terms of which other quantities of similar nature may be measured.                                                                          3rd :- Standard:- The actual physical embodiment of the unit of a physical quantity is known as a standard of that physical quantity. Fundamental Physical Quantity/Units.                                                                       4th :-Fundamental Physical Quantity/Units:- It is an elementary physical quantity, which does not require any other physical quantity to express it. It means it cannot be resolved further in terms of any other physical quantity. It is also known as basic physical quantity. The units of fundamental physical quantities are called fundamental units. For example, in M. K. S. system, Mass, Length and Time expressed in kilogram, metre and second respectively are fundamental units.Derived Physical Quantity/Units.                                                                        5th :- Derived Physical Quantities :- All those physical quantities, which can be derived from the combination of two or more fundamental quantities or can be expressed in terms of basic physical quantities, are called derived physical quantities.The units of all other physical quantities, which car. be obtained from fundamental units, are called derived units. For example, units of velocity, density and force are m/s, kg/m3, kg m/s2 respectively and they are examples of derived units..                                                                          6th :- System Of Units :-Earlier three different units systems were used in different countries. These were CGS, FPS and MKS systems. Now-a-days internationally SI system of units is followed. In SI unit system, seven quantities are taken as the base quantities.                                                                         7th :- Supplementary Units:- Besides the above mentioned seven units,there are two supplementary base units. these are (i) radian (rad) for angle, and (ii) steradian (sr) for solid angle.                                                                           8th :- Advantages of SI Unit System :- SI Unit System has following advantages over the other Besides the above mentioned seven units, there are two supplementary base units.                                                                         Parallax Method This method is used to measure the distance of planets and stars from earth.Parallax. Hold a pen in front of your eyes and look at the pen by closing the right eye and ‘ then the left eye. What do you observe? The position of the pen changes with respect to the background. This relative shift in the position of the pen (object) w.r.t. background is called parallax. If a distant object e.g., a planet or a star subtends parallax angle 0 on an arc of radius b (known as basis) on Earth, then distance of that distant object from the basis is given by.                                                                          9th :- Estimation of Molecular Size of Oleic Acid:-For this 1 cm3 of oleic acid is dissolved in alcohol to make a solution of 20 cm3. Then 1 cm3 of this solution is taken and diluted to 20 cm3, using alcohol.                                                                          10th :- Dimensions :- The dimensions of a physical quantity are the powers to which the fundamental units of mass, length and time must be raised to represent the given physical quantity.                                                                         11th :- Dimensional Formula :- The dimensional formula of a physical quantity is an expression telling us how and which of the fundamental quantities enter into the unit of that quantity. It is customary to express the fundamental quantities by a capital letter, e.g., length (L), mass (AT), time (T), electric current (I), temperature (K) and luminous intensity (C). We write appropriate powers of these capital letters within square brackets to get the dimensional formula of any given physical quantity.                                                                        12th:- Limitations of Dimensional Analysis:-The method of dimensions has the following limitations:                                                                        (i) by this method the value of dimensionless constant cannot be calculated.                                                                        (ii) by this method the equation containing trigonometric, exponential and logarithmic terms cannot be analyzed.                                                                        (iii) if a physical quantity in mechanics depends on more than three factors, then relation among them cannot be established because we can have only three equations by equalizing the powers of M, L and T.                                                                        (iv) it doesn’t tell whether the quantity is vector or scalar.                                                                        13th:- Significant Figures:-The significant figures are a measure of accuracy of a particular measurement of a physical quantity.Significant figures in a measurement are those digits in a physical quantity that are known reliably plus the first digit which is uncertain.                                                                        14th:-  Error:-The measured value of the physical quantity is usually different from its true value. The result of every measurement by any measuring instrument is an approximate number, which contains some uncertainty. This uncertainty is called error. Every calculated quantity, which is based on measured values, also has an error.                                                                        Types Of Error:-                                                                        Least Count Error. The least count error is the error associated with the resolution of the instrument. Least count may not be sufficiently small. The maximum possible error is equal to the least count.Instrumental Error. This is due to faulty calibration or change in conditions (e.g., thermal expansion of a measuring scale). An instrument may also have a zero error. A correction has to be applied.Random Error. This is also called chance error. It makes to give different results for same measurements taken repeatedly. These errors are assumed to follow the Gaussian law of normal distribution.Accidental Error. This error gives too high or too low results. Measurements involving this error are not included in calculations.Systematic Error. The systematic errors are those errors that tend to be in one direction, either positive or negative. Errors due to air buoyancy in weighing and radiation loss in calorimetry are systematic errors. They can be eliminated by manipulation. Some of the sources of systematic errors are:(i) intrumental error(ii) imperfection in experimental technique or procedure(iii) personal errors...                                                                       Chapter 3 Motion In A Straight Line:-• Introduction:-                                                                         Motion is one of the significant topics in physics. Everything in the universe moves. It might only be a small amount of movement and very-very slow, but movement does happen. Even if you appear to be standing still, the Earth is moving around the sun, and the sun is moving around our galaxy.“An object is said to be in motion if its position changes with time”.The concept of motion is a re’ live one and a body that may be in motion relative to one reference system, may be at rest relative to another.There are two branches in physics that examine the motion of an object.                                                                        (i) Kinematics: It describes the motion of objects, without looking at the cause of the motion.                                                                        (ii) Dynamics: It relates the motion of objects to the forces which cause them.                                                                       1st:- Point Object If the length covered by the objects are very large in comparison to the size of the objects, the objects are considered point objects.                                                                    2nd:-   Reference Systems :-The motion of a particle is always described with respect to a reference system. A reference system is made by taking an arbitrary point as origin and imagining a co-ordinate system to be attached to it. This co-ordinate system chosen for a given problem constitutes the reference system for it. We generally choose a co-ordinate system attached to the earth as the reference system for most of the problems..                                                                       Total Path Length (Distance) For a particle in motion the total length of the actual path traversed between initial and final positions of the particle is known as the ‘total path length’ or distance covered by it."



    },
    {
        "title": "Chemistry",
        "author": "Quick Revision",
      
        "description": "Chapter 1 To Chapter 5",
        "story": "The International Sysstem Of Units (SI)-    The International System of Units is a global standard for expressing the magnitudes or quantities of important natural phenomena. Also referred to as the metric system, the System of Units is commonly abbreviated as SI, which comes from the original French name, Système international d'unités.",
        "examples": "SomeExamples..Length - meter (m) Time - second (s) Amount of substance - mole (mole) Electric current - ampere (A)"
    },
     {
        "title": "Computer Science",
        "author": "Quick Revision",
        
        "description": "Chapter 1 To Chapter 5",
        "story": "Chapter 1.                                                                         Introduction To Computer System.                                                                         1st Definition:- Input Devices:- Devices help us to enter the data into the computer.                                                                         2nd Defination:-Output Devices:-Devices which recives data from computer system for display or physical production.                                                                          3rd Definition:-CPU:- Centeral Processiong unit carries out actual processing and reffered as the brain of computer.                                                                         There Are 2 Parts Of CPU (a)ALU:- Arithmetic Logical Unit it performs airthmetic (+,-,/) etc and logical operations AND or NOT                                                                         3rd definition:-C.U:-Control Unit controls sequential introduction executions.                                                                          4th Definitions Variables:- Named memory location whose content can vary during program execution(Located in RAM) "
    },
     {
        "title": "Biology",
        "author": "Quick Revision",
        
        "description": "Chapter 1 To Chapter 5",
        "story": "The International Sysstem Of Units (SI)-    The International System of Units is a global standard for expressing the magnitudes or quantities of important natural phenomena. Also referred to as the metric system, the System of Units is commonly abbreviated as SI, which comes from the original French name, Système international d'unités.",
        "examples": "SomeExamples..Length - meter (m) Time - second (s) Amount of substance - mole (mole) Electric current - ampere (A)"
    },
     {
        "title": "Maths",
        "author": "Quick Revision",
       
        "description": "Chapter 1 To Chapter 5",
        "story": "The International Sysstem Of Units (SI)-    The International System of Units is a global standard for expressing the magnitudes or quantities of important natural phenomena. Also referred to as the metric system, the System of Units is commonly abbreviated as SI, which comes from the original French name, Système international d'unités.",
        "examples": "SomeExamples..Length - meter (m) Time - second (s) Amount of substance - mole (mole) Electric current - ampere (A)"
    }
]